{
  "hcscr.toggle.true": "HCsCR is enabled now!",
  "hcscr.toggle.server": "HCsCR is enabled now, but is blocked by the server!",
  "hcscr.toggle.false": "HCsCR is disabled now!",
  "hcscr.server.true": "The server has enabled the mod.",
  "hcscr.server.false": "The server has disabled the mod.",
  "hcscr.server.reset": "You've left the server. Mod is enabled.",
  "hcscr.key.category": "HCsCR",
  "hcscr.key.config": "Open Config",
  "hcscr.key.toggle": "Toggle",
  "hcscr.config": "HCsCR Config",
  "hcscr.config.enabled": "Enabled",
  "hcscr.config.enabled.tip": "Whether the mod is enabled.",
  "hcscr.config.removeCrystals": "Remove Crystals",
  "hcscr.config.removeCrystals.tip": "Should the crystals be removed on left click.",
  "hcscr.config.removeSlimes": "Remove Slimes",
  "hcscr.config.removeSlimes.tip": "Should the invisible slimes and magma cubes be removed on left click. Some servers use invisible slimes to prevent crystal optimizers from working.",
  "hcscr.config.removeInteractions": "Remove Interactions",
  "hcscr.config.removeInteractions.tip": "Whether the \"interaction\" entities are removed on left click. Some servers use interaction entities to prevent crystal optimizers from working. This option has no effect in older versions, because interaction entities were added in 1.19.4.",
  "hcscr.config.removeAnchors": "Remove Anchors",
  "hcscr.config.removeAnchors.tip": "Whether the anchor blocks are removed on right click. This will prevent the \"air place\" mechanic from working. Block removal is not affected by the delay.",
  "hcscr.config.delay": "Delay",
  "hcscr.config.delay.tip": "Entity removal delay in milliseconds. Set to 0 to disable. Some players report that setting this to server's MSPT value actually makes crystal spamming faster.",
  "hcscr.config.delay.false": "Disabled",
  "hcscr.config.delay.format": "%sms.",
  "hcscr.config.batching": "Batching",
  "hcscr.config.batching.disabled": "Disabled",
  "hcscr.config.batching.disabled.tip": "Current batching mode: Batching is disabled. Entities are removed one-by-one.",
  "hcscr.config.batching.containing": "Containing",
  "hcscr.config.batching.containing.tip": "Current batching mode: Batching (least aggressive) will remove entities that are fully inside the hit entity. This option exists to combat various protection techniques against crystal optimizers, but it may mistakenly remove some entities.",
  "hcscr.config.batching.containingContained": "Containing or Contained",
  "hcscr.config.batching.containingContained.tip": "Current batching mode: Batching (more aggressive) will remove entities that are fully inside or fully outside the hit entity. This option exists to may combat various protection techniques against crystal optimizers, but it may mistakenly remove entities.",
  "hcscr.config.batching.intersecting": "Intersecting",
  "hcscr.config.batching.intersecting.tip": "Current batching mode: Batching (most aggressive) will remove entities that intersect with the hit entity. This option exists to may combat various protection techniques against crystal optimizers, but it may mistakenly remove all adjacent entities.",
  "hcscr.config.disabled": "The mod has been disabled by the current server.",
  "modmenu.descriptionTranslation.hcscr": "Remove your end crystals before the server even knows you hit 'em!",
  "modmenu.summaryTranslation.hcscr": "Remove your end crystals faster!"
}
