{
  "key.category.hcscr.root": "HCsCR",
  "hcscr.key.config": "Open Config",
  "hcscr.key.toggle": "Toggle",
  "hcscr.true": "HCsCR enabled.",
  "hcscr.false": "HCsCR disabled.",
  "hcscr.title": "HCsCR Config",
  "hcscr.close": "Save and close the config.",
  "hcscr.enable": "Enable",
  "hcscr.enable.tip": "Enable the mod.",
  "hcscr.crystals": "Crystals",
  "hcscr.crystals.off": "Off",
  "hcscr.crystals.off.tip": "Crystals won't be instantly removed via left mouse click.",
  "hcscr.crystals.direct": "Direct",
  "hcscr.crystals.direct.tip": "Only direct crystal hits will cause them to be instantly removed via left mouse click. This is the recommended mode for most situations and is the default/only mode in other crystal optimizers.",
  "hcscr.crystals.enveloping": "Enveloping",
  "hcscr.crystals.enveloping.tip": "Direct crystal hits as well as hitting some invisible entities enveloping the crystals will cause crystals to be instantly removed. This can be used on a server which uses those entities to combat hacks. BEWARE: May cause issues with anti-cheat plugins.",
  "hcscr.crystalsDelay": "Crystals Delay",
  "hcscr.crystalsDelay.tip": "Crystals removal delay after left mouse click. Some users report that setting the delay to the server's MSPT value actually makes crystal spamming a bit faster.",
  "hcscr.crystalsResync": "Crystals Resync",
  "hcscr.crystalsResync.tip": "Crystals resync delay. This is the delay after which the crystal will reappear again, if the server hasn't actually removed it. Useful to prevent ghost crystals, when a crystal hit is not registered by the server.",
  "hcscr.blocks": "Blocks",
  "hcscr.blocks.off": "Off",
  "hcscr.blocks.off.tip": "Blocks (anchors/beds) won't be instantly removed via right mouse click.",
  "hcscr.blocks.collision": "Collision",
  "hcscr.blocks.collision.tip": "Only the player collision for blocks (anchors/beds) will be instantly removed via right mouse click. This is the recommended mode for most situations and is the default/only mode in other optimizers.",
  "hcscr.blocks.full": "Full",
  "hcscr.blocks.full.tip": "The block (anchor/bed) will be instantly removed via right mouse click. The \"air place\" strategy will stop working.",
  "hcscr.delay.off": "Disabled",
  "hcscr.delay.format": "%sms",
  "modmenu.descriptionTranslation.hcscr": "Remove your end crystals before the server even knows you hit 'em!",
  "modmenu.summaryTranslation.hcscr": "Remove your end crystals faster!"
}
